In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                   columns=['col01','col02','col03'],
                   index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [4]:
import numpy as np #高速にリストを計算するためのライブラリ

In [6]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                            columns=['col1','col2','col3'],
                            index=['idx1','idx2','idx3'])
df

      col1  col2  col3
idx1     1     2     3
idx2     4     5     6
idx3     7     8     9

In [7]:
df.index

Index(['idx1', 'idx2', 'idx3'], dtype='object')

In [8]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [12]:
df = pd.DataFrame([[1,2,3],
                  [4,5,6],
                  [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df.columns=['1','2','3']

In [14]:
df.index=['1','2','3']

In [15]:
df

   1  2  3
1  1  2  3
2  4  5  6
3  7  8  9

In [16]:
df =df.rename(columns={'1':'x','2':'y'})

In [17]:
df

   x  y  3
1  1  2  3
2  4  5  6
3  7  8  9

In [18]:
df['x']

1    1
2    4
3    7
Name: x, dtype: int64

In [19]:
type(df['x'])

pandas.core.series.Series

In [21]:
df.loc['1'] #locは行を取得する。１行目行、２行目列

x    1
y    2
3    3
Name: 1, dtype: int64

In [22]:
df.loc['1','x']

1

In [26]:
df.loc[:,'x']

1    1
2    4
3    7
Name: x, dtype: int64

In [27]:
df.iloc[:,1:3]   #複数行の取得

   y  3
1  2  3
2  5  6
3  8  9

In [29]:
df.index.get_loc('1') #行番号列番号を取得

0

In [30]:
df.dtypes

x    int64
y    int64
3    int64
dtype: object

In [32]:
df.shape

(3, 3)

In [33]:
df.T  #逆になる

   1  2  3
x  1  4  7
y  2  5  8
3  3  6  9

In [35]:
df = pd.DataFrame({'col01':[1,2,3],'col02':[4,5,6],'col03':[7,8,9]}
                   ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [37]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [39]:
df = df.rename(index={'idx03':'idx04'})
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx04      3      6      9

In [40]:
df['col01']

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [41]:
df.iloc[:,0]

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [42]:
df.loc[:,'col01':'col02']

       col01  col02
idx01      1      4
idx02      2      5
idx04      3      6

In [43]:
df.dtypes

col01    int64
col02    int64
col03    int64
dtype: object